read_verilog -sv  counter.v;
hierarchy -top Main -check
proc;
opt;
opt_reduce;
opt_demorgan;
opt_clean;
write_rtlil counter_tb_0.rtl;
manticore_init;
write_rtlil counter_tb_1.rtl;
manticore_memory;
write_rtlil counter_tb_2.rtl;
flatten;
manticore_meminit;
write_rtlil counter_tb_3.rtl;
opt;
manticore_dff;
write_rtlil counter_tb_4.rtl;
manticore_opt_replicate;
write_rtlil counter_tb_5.rtl;
manticore_subword;
write_rtlil counter_tb_6.rtl;
manticore_check;
manticore_writer counter.masm;
